Data Loading, Storage, and File Formats
-
- Topic Reading and Writing Data in Text Format
- Parsing functions in pandas

- read_csv = load delimited data from a file, URL, or file-like
- object; use comma as default delimiter

- read_excel = Read tabular data from an Excel XLS or XLSX file
- read_html = Read all tables found in the given HTML document

common options in these functions
-
- Indexing
Can treat one or more columns as the returned DataFrame, and whether to get column names from the file, the user, or not at all.

- Type inference and data conversion
This includes the user-defined value conversions and custom list of missing value markers.

- Datetime parsing
Includes combining capability, including combining date and time information spread over multiple columns into a single column in the result.

- Iterating
Support for iterating over chunks of very large files.

- Unclean data issues
Skipping rows or a footer, comments, or other minor things like numeric data with thousands separated by commas.

# loading it into pandas data frame

In [17]:
import pandas as pd

In [18]:
sample_df= pd.read_csv("examples/sample.csv")
print(sample_df)

  studentid         name   chimestry   physics   english   math
0       A01     arif ali          20        30        40     50
1       A02  kamran khan          30        40        50     60
2       A03   imran ali           40        50        60     70
3       A04  kashif khan          50        60        70     80

In [20]:
data = pd.read_csv("D:/ABU BAKAR MS-AI/Dataset/2 Minutes 28 Subjects Data for Processing.csv")
data.head()

C:\Users\Engr Saeed\AppData\Local\Temp\ipykernel_7176\3946012906.py:1: DtypeWarning: Columns (1,2,5,6,9,10,13,14,17,18) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv("D:/ABU BAKAR MS-AI/Dataset/2 Minutes 28 Subjects Data for Processing.csv")

,Delta_TP9,Delta_AF7,Delta_AF8,Delta_TP10,Theta_TP9,Theta_AF7,Theta_AF8,Theta_TP10,Alpha_TP9,Alpha_AF7,...,Alpha_TP10,Beta_TP9,Beta_AF7,Beta_AF8,Beta_TP10,Gamma_TP9,Gamma_AF7,Gamma_AF8,Gamma_TP10,PSS Score
0,3.071577,0.474801,2.476777,4.036586,2.033074,0.115887,1.714873,3.145704,2.182044,1.01952,...,3.088445,1.638719,0.616832,1.149402,2.604956,1.055608,0.318293,0.630827,2.005793,16
1,3.071577,0.474801,2.476777,4.036586,2.033074,0.115887,1.714873,3.145704,2.182044,1.01952,...,3.088445,1.638719,0.616832,1.149402,2.604956,1.055608,0.318293,0.630827,2.005793,16
2,3.071577,0.474801,2.476777,4.036586,2.033074,0.115887,1.714873,3.145704,2.182044,1.01952,...,3.088445,1.638719,0.616832,1.149402,2.604956,1.055608,0.318293,0.630827,2.005793,16
3,3.071577,0.474801,2.476777,4.036586,2.033074,0.115887,1.714873,3.145704,2.182044,1.01952,...,3.088445,1.638719,0.616832,1.149402,2.604956,1.055608,0.318293,0.630827,2.005793,16
4,3.071577,0.474801,2.476777,4.036586,2.033074,0.115887,1.714873,3.145704,2.182044,1.01952,...,3.088445,1.638719,0.616832,1.149402,2.604956,1.055608,0.318293,0.630827,2.005793,16

In [21]:
sample_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   studentid   4 non-null      object
 1    name       4 non-null      object
 2    chimestry  4 non-null      int64
 3    physics    4 non-null      int64
 4    english    4 non-null      int64
 5    math       4 non-null      int64
dtypes: int64(4), object(2)
memory usage: 320.0+ bytes

we can change the column names while loading data
-

In [23]:
sample_df= pd.read_csv("examples/sample.csv")
sample_df

  studentid         name   chimestry   physics   english   math
0       A01     arif ali          20        30        40     50
1       A02  kamran khan          30        40        50     60
2       A03   imran ali           40        50        60     70
3       A04  kashif khan          50        60        70     80

In [25]:
#  change the column names while loading data

sample_df=pd.read_csv("examples/sample.csv",skiprows=1,
                     names=['id', 'name', 'ch', 'ph', 'en', 'math'])
sample_df

    id         name  ch  ph  en  math
0  A01     arif ali  20  30  40    50
1  A02  kamran khan  30  40  50    60
2  A03   imran ali   40  50  60    70
3  A04  kashif khan  50  60  70    80

# Handling Missing Values

In [26]:
result = pd.read_csv('examples/sample3.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
#changing data while loading in dataframe

#diconary=  column name : [source values, target value]#

sentinels = {'message':   ['foo', 'NA']}

pd.read_csv('examples/sample3.csv', na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

-  By default, pandas uses a set of commonly occurring sentinels, such as NA and NULL

# Reading and Text Files in Pieces

In [29]:
data =pd.read_csv('datasets/train.csv')
print(data)

      battery_power  blue  clock_speed  dual_sim  fc  four_g  int_memory  \
0               842     0          2.2         0   1       0           7
1              1021     1          0.5         1   0       1          53
2               563     1          0.5         1   2       1          41
3               615     1          2.5         0   0       0          10
4              1821     1          1.2         0  13       1          44
...             ...   ...          ...       ...  ..     ...         ...
1995            794     1          0.5         1   0       1           2
1996           1965     1          2.6         1   0       0          39
1997           1911     0          0.9         1   1       1          36
1998           1512     0          0.9         0   4       1          46
1999            510     1          2.0         1   5       1          45

      m_dep  mobile_wt  n_cores  ...  px_height  px_width   ram  sc_h  sc_w  \
0       0.6        188        2  ...         20       756  2549     9     7
1       0.7        136        3  ...        905      1988  2631    17     3
2       0.9        145        5  ...       1263      1716  2603    11     2
3       0.8        131        6  ...       1216      1786  2769    16     8
4       0.6        141        2  ...       1208      1212  1411     8     2
...     ...        ...      ...  ...        ...       ...   ...   ...   ...
1995    0.8        106        6  ...       1222      1890   668    13     4
1996    0.2        187        4  ...        915      1965  2032    11    10
1997    0.7        108        8  ...        868      1632  3057     9     1
1998    0.1        145        5  ...        336       670   869    18    10
1999    0.9        168        6  ...        483       754  3919    19     4

      talk_time  three_g  touch_screen  wifi  price_range
0            19        0             0     1            1
1             7        1             1     0            2
2             9        1             1     0            2
3            11        1             0     0            2
4            15        1             1     0            1
...         ...      ...           ...   ...          ...
1995         19        1             1     0            0
1996         16        1             1     1            2
1997          5        1             1     0            3
1998         19        1             1     1            0
1999          2        1             1     1            3

[2000 rows x 21 columns]

In [30]:
data.shape

(2000, 21)

In [ ]:
#extracting selected rows from a large datasets
data =pd.read_csv('datasets/train.csv', nrows=200)

In [ ]:
print(data)

Chunks mean 2000 rows loads or reads in 10 chunks because each chunks has read 200 rows
-

In [ ]:
#To read a file in pieces, specify a chunksize as a number of rows:

chunks = pd.read_csv('datasets/train.csv', chunksize=200)
print(type(chunks), print(chunks) )

In [ ]:

chunks = pd.read_csv('datasets/train.csv', chunksize=200)

chunkList = []
for chunk in chunks:
    chunkList.append(chunk)
    
    
#print(chunkList) 

df = chunkList[0] 
df.head()

# read text file in pandas

In [ ]:
data = list(open('examples/ex3.txt'))
print(data)
# use spaces (one or more ) as delimiter 
#result = pd.read_table('examples/ex3.txt', sep='\s+')
#result

In [ ]:
# use spaces (one or more ) as delimiter 

result = pd.read_table('examples/ex3.txt', sep='\s+')
result

In [ ]:
df = pd.read_csv('examples/ex4.csv') #skiprows=[0, 2, 3])
df

In [ ]:
df = pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])
df

# JSON Data
- short for JavaScript Object Notation

In [ ]:
data = pd.read_json('examples/example.json')
data

In [ ]:
js = pd.read_json("json/hy.json")
print(js)
js.head()

# XML and HTML: Web data loading in to dataframe

In [ ]:
#conda install lxml
# conda install -c anaconda beautifulsoup4 
# htconda install -c anaconda html5lib

In [ ]:
import pandas as pd
tables = pd.read_html('examples/fdic_failed_bank_list.html')
# tables variable type is not dataframe, its list
print(type(tables))
print(len(tables))

In [ ]:
fa_df = tables[0]
type(fa_df)

In [ ]:
fa_df.head()

In [ ]:
failures_df = tables[0]

print(type(failures_df))
print(failures_df.shape)

In [ ]:
# warning: data is bit lengthy in this data frame
print(failures_df.columns)
len(failures_df)
#print(failures_df["City"].head())
#print(failures_df["Bank Name"].head())
#print(failures_df.head())

In [ ]:
print(failures_df["City"].head())
#print(failures_df["Bank Name"].head())
#print(failures_df.head())

In [ ]:
print(failures_df["Bank Name"].head())

In [ ]:
print(failures_df.head())

# Reading Microsoft Excel Files

In [ ]:
import pandas as pd

xlsx = pd.ExcelFile('examples/ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')